--------------------------------------------------------------------------------
-- Utils/MathUtils.lua
--------------------------------------------------------------------------------

Global( "MathUtils", {} )

--------------------------------------------------------------------------------
--- Математический модуль (остаток от деления).
--- В Lua оператор % для отрицательных чисел может возвращать отрицательный результат. 
--- Результат всегда будет в диапазоне [0, b-1].
--- @param a number делимое
--- @param b number делитель
--- @return number
--------------------------------------------------------------------------------
function MathUtils.safeModulo( a, b )
    return ( ( a % b ) + b ) % b
end

--------------------------------------------------------------------------------
--- (shallow copy) Поверхностное (неглубокое) копирование таблицы.
--- В общем: Просто так скопировать таблицу в lua нельзя, иначе копия будет ссылаться к родителю.
--- @param tbl table
--- @return table copy
--------------------------------------------------------------------------------
function MathUtils.shallowCopy( tbl )
	if type( tbl ) ~= "table" then return {} end
	
	local copy = {}
	for k, v in pairs( tbl ) do
		copy[ k ] = v
	end
	
	return copy
end