--------------------------------------------------------------------------------
-- Core/AlchemyBootstrap.lua
-- Класс-бутстрап (загрузчик) аддона.
--------------------------------------------------------------------------------

Class( "AlchemyBootstrap", {
    _eventManager = nil, -- Менеджер событий
} )

--------------------------------------------------------------------------------
--- Инициализация бутстрапа.
--- @param eventManager table - экземпляр класса AlchemyEventManager
--------------------------------------------------------------------------------
function AlchemyBootstrap:Init( eventManager )
    self._eventManager = eventManager
end

--------------------------------------------------------------------------------
-- Запуск начальной логики аддона.
-- Проверяет, создан ли уже (аватар) на момент запуска аддона.
--------------------------------------------------------------------------------
function AlchemyBootstrap:Run()
    if avatar.IsExist() then
        self._eventManager:Dispatch( "EVENT_AVATAR_CREATED", { id = avatar.GetId() } )
    end
end