--------------------------------------------------------------------------------
-- GLOBALS
-- Глобальные переменные аддона, используемые для хранения состояния, 
-- кэширования данных рецептов, компонентов и состояния интерфейса.
--------------------------------------------------------------------------------

Global( "LibreAlchemy", {
	-- welcomeBack:
	-- true: при закрытии окна алхимии для сообщения "С возвращением".
	-- false: при первом открытии алхимии за сессию игры.
	-- nil: при продолжении работы алхимии.
	welcomeBack = false, 
	reactionSuccess = false, -- Забрали зелье после варки.
	
	-- Состояние рабочей атмосферы.
	lReci = nil,       -- Кэш списка всех доступных рецептов алхимии (таблица).
	lFilt = nil,       -- Отфильтрованный список рецептов, подходящих под текущие компоненты в барабанах.
	lCodr = nil,       -- Карта сдвигов: хранит компоненты в барабанах с учетом возможных сдвигов (индекс [барабан][сдвиг] = имя компонента).
	lFound = nil,      -- Таблица найденных подходящих вариантов (рецепт + сдвиги барабанов) для текущей реакции.
	nDrums = 2,        -- Стандартное/минимальное количество барабанов в текущем алхимическом инструменте.
	nSinshi = 6,       -- Максимально допустимое количество коррекций (сдвигов) в барабане.
	maxDisplay = 5,    -- Максимальное количество рецептов для вывода в интерфейс (топ-N результатов).

	place = {
		-- placed:
		-- nil: исходное состояние. 
		-- true: предметы вставлены.
		-- false: предметы убраны
		placed = nil, 
		readyNotFoundMessage = false,
		
		-- В связи с тем, что имеем специфическую/(вынос мозга) работу с предоставленными API функциями,
		-- делаем счётчик в событии "EVENT_ALCHEMY_ITEM_PLACED" для посчёта вставленных компонентов.
		count = 0,
	},
	widgets = {},            -- Всё что тебя касается.
	events = {},             -- Всё что меня касается.
	fn = {},
	debug = false,
	debugReaction = false,
} )

-- Global( "log", Facade.customAO.log )