--------------------------------------------------------------------------------
-- Events/AlchemyPosEvents.lua
-- Класс, отвечающий за обработку событий (EVENT_POS_*).
--------------------------------------------------------------------------------

Class( "AlchemyPosEvents", EventClassInterface() )

--------------------------------------------------------------------------------
--- @param context table AlchemyContext
--------------------------------------------------------------------------------
function AlchemyPosEvents:Init( context ) --- void
    self._services = context:GetServices()   -- Cервисы.
end

--------------------------------------------------------------------------------
--- Маппинг событий.
--- Возвращает таблицу соответствия имен событий методам-обработчикам.
--- @return table
--------------------------------------------------------------------------------
function AlchemyPosEvents:GetEventMap()
    return {
        EVENT_POS_CONVERTER_CHANGED = self.OnPosConverterChanged,
    }
end

--------------------------------------------------------------------------------
-- Обработчики событий
--------------------------------------------------------------------------------

--------------------------------------------------------------------------------
-- Обработчик события EVENT_POS_CONVERTER_CHANGED.
-- Уведомление об изменении игрового окна.
--------------------------------------------------------------------------------
function AlchemyPosEvents:OnPosConverterChanged() --- void
    ----------------------------------------
    self._services.debug:LogGeneral( "EVENT_POS_CONVERTER_CHANGED" )
    ----------------------------------------

    self._services.dnd:OnPosConverterChanged()
end