--------------------------------------------------------------------------------
-- UI/Widgets/WidgetDnD.lua
-- Обертка над виджетом для интеграции с библиотекой Drag & Drop (LibDnD).
-- Отвечает за инициализацию механизма перетаскивания для окна с подсказкой.
--------------------------------------------------------------------------------

Class( "WidgetDnD", WidgetClassInterface() )

--------------------------------------------------------------------------------
--- Инициализация виджета.
--- @param widgetManager table - экземпляр класса AlchemyWidgetManager
--------------------------------------------------------------------------------
function WidgetDnD:Init( widgetManager ) --- void
	self._widgetManager = widgetManager
end

--------------------------------------------------------------------------------
--- Инициализировать механизм Drag & Drop для окна с подсказкой.
--- @return boolean
--------------------------------------------------------------------------------
function WidgetDnD:InitDragAndDrop()
    -- Получаем обертку над Panel через менеджер
    local panelWrapper = self._widgetManager:GetWidgetWrapper( "panel" )

    if rawget( _G, "DnD" ) and panelWrapper then
        -- Инициализируем Drag & Drop для Panel
        _G.DnD.Init( panelWrapper:GetNativeWidget() )
        return true
    end
    return false
end

--------------------------------------------------------------------------------
--- Получить имя виджета для регистрации в менеджере.
--- @return string
--------------------------------------------------------------------------------
function WidgetDnD:GetWidgetName()
	return "Drag&Drop"
end

--------------------------------------------------------------------------------
--- Получить ссылку на связанный объект.
--- В данном случае возвращает глобальную таблицу библиотеки LibDnD, если она загружена.
--- @return userdata | table | nil
--------------------------------------------------------------------------------
function WidgetDnD:GetNativeWidget()
	-- возвращает таблицу библиотеки DnD, а не стандартный RawWidget
	return rawget( _G, "DnD" ) and _G.DnD or nil
end
